const { expect } = require( 'chai' )

const { countSyllables } = require( '../index' )

const tests = [
  [ 'ਕਸਰਤ', 4 ],
  [ 'ਬਰਕਤ', 4 ],
  [ 'ਮਿਹਨਤ', 4 ],
  [ 'ਮੁਜਰਮ', 4 ],
  [ 'ਗੁਰਮੁਖ', 4 ],
  [ 'ਕਾਕੀਏ', 6 ],
  [ 'ਤੌਲੀਆ', 6 ],
  [ 'ਤੋਰੀਆ', 6 ],
  [ 'ਚੀਰੀਏ', 6 ],
  [ 'ਤੰਬੂਰਾ', 6 ],
  [ 'ਲੰਮਾਈ', 6 ],
  [ 'ਬੱਚੀਏ', 6 ],
  [ 'ਸਾਗ', 3 ],
  [ 'ਦੌੜ', 3 ],
  [ 'ਪੀੜ', 3 ],
  [ 'ਹਿੱਲ', 3 ],
  [ 'ਵਿਚੋਂ', 3 ],
  [ 'ਤਲਾ', 3 ],
  [ 'ਸਿਰੀ', 3 ],
  [ 'ਗੁਆ', 3 ],
  [ 'ਸਰਲ', 3 ],
  [ 'ਹਿਕਮਤ', 4 ],
  [ 'ਉਜਰਤ', 4 ],
  [ 'ਸਾਰ', 3 ],
  [ 'ਸਾਰਾ ਸਾਰੇ', 8 ],
  [ 'ਕੂਲਾ ਕੂਲੀ', 8 ],
  [ 'ਗੁਲਾਈ', 5 ],
  [ 'ਚੁੜਾਈ', 5 ],
  [ 'ਜੋੜੀਆਂ', 6 ],
  [ 'ਵੱਟਿਆਂ', 5 ],
  [ 'ਵੱਟੀਆਂ', 6 ],
  [ 'ਅੰਮ੍ਰਿਤ', 4 ],
  [ 'ਅੰਮ੍ਰਿਤਸਰ', 6 ],
  [ 'ਦੇਵਿੰਦਰ', 6 ],
  [ 'ਕਿਰਪਾਲਤਾ', 7 ],
  [ 'ਪ੍ਰਭੂ ਪ੍ਰੇਮੀ ਪੜ੍ਹ ਚੜ੍ਹ ਦ੍ਵੈਤ', 14 ],
]

describe( 'countSyllables()', () => {
  tests.map( ( [ input, output ] ) => it( `should convert '${input}' to '${output}'`, () => {
    expect( countSyllables( input ) ).to.equal( output )
  } ) )
} )
