const { toShahmukhi } = require( '../index' )

// Test words
const words = [
  [ 'ਖੋਜ', 'کھوج' ],
  [ 'ਤੂ ਪ੍ਰਭ ਦਾਤਾ ਦਾਨਿ ਮਤਿ ਪੂਰਾ ਹਮ ਥਾਰੇ ਭੇਖਾਰੀ ਜੀਉ ॥', 'تُو پربھ داتا دان مت پُورا هم تھارے بھےکھاری جیو ۔۔' ],
  [ 'ਸੋ ਬ੍ਰਹਮੁ ਅਜੋਨੀ ਹੈ ਭੀ ਹੋਨੀ ਘਟ ਭੀਤਰਿ ਦੇਖੁ ਮੁਰਾਰੀ ਜੀਉ ॥੨॥', 'سو برهمُ اجونی ہَے بھی ہونی گھٹ بھیتر دیکھُ مُراری جیو ۔۔۲۔۔' ],
  [ 'ਜ਼ਨੇ ਪੇਚ ਦਸਤਾਰ ਰਾ ਤਾਬਦਾਦ ॥', 'زنے پتچ دستار را تابداد ۔۔' ],
  [ 'ਸਉਡਿਸਇਸ ਇਸ ਇਸਣੀ ਆਦਿ ਬਖਾਨਿ ਕੈ ॥', 'سوڈِسِاس ِاس ِاسݨی آد بک۪ن کَے ۔۔' ],
  [ 'ਅਜ਼ੋ ਗਸ਼ਤਾ ਹਰ ਜ਼ੱਰਰਾ ਖ਼ੁਰਸ਼ੈਦ ਤਾਬ ॥੯੬॥', 'ازو گشتا هر زّررا خوِرشَید تاب ۔۔۹۶۔۔' ],
  [ 'ਹਮਾ ਸਾਇਲਿ ਲੁਤਫ਼ਿ ਹਕ ਪਰਵਰਸ਼ ॥', 'ہما ساِال لُتف ہک پرورش ۔۔' ],
  [ 'ਸੁ ਬੈਠਿ ਇਕੰਤ੍ਰ ॥੫੭੮॥', 'سُ بَیٹھ ِاکںتر ۔۔۵۷۸۔۔' ],
  [ 'ਇਤਿ ਸ੍ਰੀ ਬਚਿਤ੍ਰ ਨਾਟਕੇ ਮਨੁ ਰਾਜਾ ਕੋ ਰਾਜ ਸਮਾਪਤੰ ॥੧॥੫॥', 'ِات سری بچِتر ناٹکے من راجا کو راج سماپتں ۔۔۱۔۔۵۔۔' ],
  [ 'ਤਿਸੁ ਵਿਣੁ ਸਭੁ ਅਪਵਿਤ੍ਰੁ ਹੈ ਜੇਤਾ ਪੈਨਣੁ ਖਾਣੁ ॥', 'تِسُ وِݨُ سبھ اپوِترُ ہَے جیتا پَینݨُ کھاݨُ ۔۔' ],
  [ 'ਸੋਢੀ ਸ੍ਰਿਸ੍ਟਿ ਸਕਲ ਤਾਰਣ ਕਉ ਅਬ ਗੁਰ ਰਾਮਦਾਸ ਕਉ ਮਿਲੀ ਬਡਾਈ ॥੩॥', 'سوڈھی سرِسٹ سکل تارݨ کاُ اب گُر رامداس کاُ مِلی بڈاای ۔۔۳۔۔' ],
  [ 'ਰਾਗੁ ਗਉੜੀ ਥਿਤੰੀ ਕਬੀਰ ਜੀ ਕੰੀ ॥', 'راگ گاُڑی تھِتںی کبیر جی کںی ۔۔' ],
  [ 'ਸੁ ਸਿਰਿ ਹਰਿ ਹਿਰ ਕਰਹਿ ਹਿਰੁ ਰਹੁ ਸੁਹੰਗ ਕੂਕਰੁ ਸਰਸੁ ਜੁ ਜੁਜੁ ਏਹਿ ਭਿ ਦਾਤਿ ॥', 'سُ سِر هرِ ہِر کرهِ ہِرُ رهُ سُہّںگ کُوکرُ سرسُ جُ جُجُ ایهِ بھِ داتِ ۔۔' ], // Random string of words to check regex
  [ 'ਹੁਕਮੈ ਅੰਦਰਿ. ਸਭੁ ਕੋ; ਬਾਹਰਿ ਹੁਕਮ. ਨ ਕੋਇ ॥', 'هُکمَے اںدر۔ سبھ کو؛ باهر هُکم۔ ن کوئ ۔۔' ],
  [ 'ਉਹ', 'اوہ' ],
  [ 'ਉਪਮੇਯ', 'اُپمے' ],
  [ 'ਯਸ਼', 'یش' ],
  [ 'ਉਪਾਓ', 'اُپاؤ' ],
  // hamza at end of word to rare to include rule for at the moment
  // [ 'ਪਰਗਟਾਅ', 'پرگٹاء' ],
  [ 'ਉਪੇਖਿਆ', 'اُپیکھیا' ],
  [ 'ਹੀਂਗਾ', 'ہینگا' ],
]

describe( 'toShahmukhi()', () => {
  words.map( ( [ unicode, shahmukhi ] ) => it( `should convert '${unicode}' to '${shahmukhi}'`, () => {
    expect( toShahmukhi( unicode ) ).toBe( shahmukhi )
  } ) )
} )
